
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/ShinyaIshitobi/sample-ecs-terraform/actions/runs/4114598707)



<pre><code>Apply complete! Resources: 9 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-06106a0d2ef2c0116]
data.aws_iam_policy_document.ecs_assume: Reading...
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0ebd6f7341c251dbe]
data.aws_iam_policy_document.ecs_task_assume: Reading...
data.aws_iam_policy_document.ecs_assume: Read complete after 0s [id=320642683]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-07a8452976b37b3dc]
data.aws_iam_policy_document.ecs_task_assume: Read complete after 0s [id=320642683]
aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:975746537356:targetgroup/go-simple-server-target-group/c683412ba49094f7]
aws_security_group.alb: Refreshing state... [id=sg-0467d9d31d08bbee2]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0d4a0966656b7a904]
aws_security_group.ecs: Refreshing state... [id=sg-00b7dae4665e9cfa0]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0d6bbd6c377a6f278]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-047f345f74a757e67]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0b76ad8078b1e0da4]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-05497d426229efa5b]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0452f38432ffd7bef]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-096adb5f450be3f7c]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0f8a7f8dc43702913]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-1051370401]
aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:975746537356:loadbalancer/app/go-simple-server-alb/cb62733d2186c778]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0c25eb5b25550c9cb]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-012e54b711e8d27cc]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0072642578ebc56ce]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-06546235e35e7b706]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-00d186c51cb1a8d0f]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0da2d81e4ab220b85]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0452f38432ffd7bef1080289494]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-096adb5f450be3f7c1080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0f8a7f8dc437029131080289494]
aws_lb_listener.alb_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:975746537356:listener/app/go-simple-server-alb/cb62733d2186c778/55b18cc47058921d]
aws_lb_listener_rule.alb_lister_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:975746537356:listener-rule/app/go-simple-server-alb/cb62733d2186c778/55b18cc47058921d/bf0307794bf864cc]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.cloudwatch_log_group will be created
  + resource "aws_cloudwatch_log_group" "cloudwatch_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/ecs/go-simple-server"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # aws_ecr_lifecycle_policy.ecr_lifecycle_policy will be created
  + resource "aws_ecr_lifecycle_policy" "ecr_lifecycle_policy" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 30 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 30
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "go-simple-server"
    }

  # aws_ecr_repository.ecr_repository will be created
  + resource "aws_ecr_repository" "ecr_repository" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "go-simple-server"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecs_cluster.ecs_cluster will be created
  + resource "aws_ecs_cluster" "ecs_cluster" {
      + arn                = (known after apply)
      + capacity_providers = (known after apply)
      + id                 = (known after apply)
      + name               = "go-simple-server"
      + tags_all           = (known after apply)

      + default_capacity_provider_strategy {
          + base              = (known after apply)
          + capacity_provider = (known after apply)
          + weight            = (known after apply)
        }

      + setting {
          + name  = (known after apply)
          + value = (known after apply)
        }
    }

  # aws_ecs_service.ecs_service will be created
  + resource "aws_ecs_service" "ecs_service" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "go-simple-server"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "go-simple-server"
          + container_port   = 8080
          + target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:975746537356:targetgroup/go-simple-server-target-group/c683412ba49094f7"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-00b7dae4665e9cfa0",
            ]
          + subnets          = [
              + "subnet-047f345f74a757e67",
              + "subnet-0b76ad8078b1e0da4",
            ]
        }
    }

  # aws_ecs_task_definition.ecs_task_definition will be created
  + resource "aws_ecs_task_definition" "ecs_task_definition" {
      + arn                      = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + environment      = [
                      + {
                          + name  = "HEALTH_CHECK_PATH"
                          + value = "/health_checks"
                        },
                      + {
                          + name  = "NGINX_PORT"
                          + value = "8080"
                        },
                    ]
                  + image            = "medpeer/health_check:latest"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/aws/ecs/go-simple-server"
                          + awslogs-region        = "ap-northeast-1"
                          + awslogs-stream-prefix = "app"
                        }
                    }
                  + name             = "go-simple-server"
                  + portMappings     = [
                      + {
                          + containerPort = 8080
                          + hostPort      = 8080
                        },
                    ]
                },
            ]
        )
      + cpu                      = "256"
      + execution_role_arn       = (known after apply)
      + family                   = "go-simple-server"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
      + task_role_arn            = (known after apply)
    }

  # aws_iam_role.ecs will be created
  + resource "aws_iam_role" "ecs" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "go-simple-server-ecs"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.ecs_task will be created
  + resource "aws_iam_role" "ecs_task" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "go-simple-server-ecs-task"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.ecs_basic will be created
  + resource "aws_iam_role_policy_attachment" "ecs_basic" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "go-simple-server-ecs"
    }

Plan: 9 to add, 0 to change, 0 to destroy.
aws_ecs_cluster.ecs_cluster: Creating...
aws_iam_role.ecs: Creating...
aws_ecr_repository.ecr_repository: Creating...
aws_cloudwatch_log_group.cloudwatch_log_group: Creating...
aws_iam_role.ecs_task: Creating...
aws_ecr_repository.ecr_repository: Creation complete after 1s [id=go-simple-server]
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Creating...
aws_cloudwatch_log_group.cloudwatch_log_group: Creation complete after 1s [id=/aws/ecs/go-simple-server]
aws_iam_role.ecs: Creation complete after 1s [id=go-simple-server-ecs]
aws_iam_role_policy_attachment.ecs_basic: Creating...
aws_iam_role.ecs_task: Creation complete after 1s [id=go-simple-server-ecs-task]
aws_ecs_task_definition.ecs_task_definition: Creating...
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Creation complete after 0s [id=go-simple-server]
aws_iam_role_policy_attachment.ecs_basic: Creation complete after 0s [id=go-simple-server-ecs-20230207135520394900000001]
aws_ecs_task_definition.ecs_task_definition: Creation complete after 1s [id=go-simple-server]
aws_ecs_cluster.ecs_cluster: Still creating... [10s elapsed]
aws_ecs_cluster.ecs_cluster: Creation complete after 12s [id=arn:aws:ecs:ap-northeast-1:975746537356:cluster/go-simple-server]
aws_ecs_service.ecs_service: Creating...
aws_ecs_service.ecs_service: Creation complete after 2s [id=arn:aws:ecs:ap-northeast-1:975746537356:service/go-simple-server/go-simple-server]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 9 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":12,"Program":"tfcmt","SHA1":"6a14b2dc2583638506c60bff93d07a6a57c5ca79","Vars":{},"WorkflowName":"Terraform"} -->